In [1]:
#import libraries

import mysql.connector
from mysql.connector import Error
import pandas as pd

In [2]:
def create_server_connection(host_name,user_name,user_password):
    connection=None
    try:
        connection = mysql.connector.connect(
            host=host_name,
            user=user_name,
            password=user_password
        )
        print('mysql database connection successfully ')
    except Error as err:
        print(f"Error:'{err}'")
    return connection
#put our mysql Terminal Password
      
password="S!mple123"              
#database name
db= "vruti"              
connection = create_server_connection("localhost", "root", password)

mysql database connection successfully

In [3]:
#create mysql_pythod
  
#create_databse is a funcation (one fun create with 2 parametres)
def create_database(connection,query):
    cursor=connection.cursor()
    try:
        cursor.execute(query)
        print("Database Create successfully")
    except Error as err:
        print(f"Error:'{err}'")
create_database_query="create database vruti"        
create_database(connection,create_database_query)

Database Create successfully

In [4]:
#connect to database

def create_db_connection(host_name,user_name,user_password,db_name):
    connection=None
    try:
        connection = mysql.connector.connect(
            host=host_name,
            user=user_name,
            password=user_password,
            database=db_name)
        print('mysql database connection successfully ')
    except Error as err:
        print(f"Error:'{err}'")
    return connection

In [5]:
#Exceute sql queries

def execute_query(connection,query):
    cursor=connection.cursor()
    try:
        cursor.execute(query)
        connection.commit()
        print(" Query was successfully")
    except Error as err:
        print(f"Error:'{err}'")

In [6]:
create_orders_table= """
create table orders(
order_id int primary key,
customer_name varchar(30) not null,
product_name varchar(20) not null,
date_ordered date,
quantity int,
unit_price float,
phone_number varchar(20));
"""
#connect to the database

connection = create_db_connection("localhost","root",password,db)
execute_query(connection,create_orders_table)

mysql database connection successfully
 Query was successfully

In [7]:
#insert data

data_orders = """
insert into orders values
(101,'steve','laptop','2018-06-12',2,800,'1234567890'),
(102,'jos','books','2019-02-10',10,12,'1234567890'),
(103,'stacy','trouseres','2019-12-25',5,50,'1234567890'),
(104,'nancy','t_shirts','2018-07-14',7,30,'1234567890'),
(105,'maria','headphone','2019-05-30',6,48,'1234567890');
"""

connection = create_db_connection("localhost","root",password,db)
execute_query(connection,data_orders)

mysql database connection successfully
 Query was successfully

In [8]:
def read_query(connection,query):
    cursor=connection.cursor()
    result=None
    try:
        cursor.execute(query)
        result=cursor.fetchall()
        return result
    except Error as err:
        print(f"Error:'{err}'")

In [9]:
#using the select sttmt:(all data show)
q1="""
select * from orders;
"""
connection = create_db_connection("localhost","root",password,db)
results=read_query(connection,q1)
for result in results:
    print(result)

mysql database connection successfully
(101, 'steve', 'laptop', datetime.date(2018, 6, 12), 2, 800.0, '1234567890')
(102, 'jos', 'books', datetime.date(2019, 2, 10), 10, 12.0, '1234567890')
(103, 'stacy', 'trouseres', datetime.date(2019, 12, 25), 5, 50.0, '1234567890')
(104, 'nancy', 't_shirts', datetime.date(2018, 7, 14), 7, 30.0, '1234567890')
(105, 'maria', 'headphone', datetime.date(2019, 5, 30), 6, 48.0, '1234567890')

In [10]:
#using the select sttmt:(name and conect number data show in table)
q2="""
select customer_name,phone_number from orders;
"""
connection = create_db_connection("localhost","root",password,db)
results=read_query(connection,q2)
for result in results:
    print(result)

mysql database connection successfully
('steve', '1234567890')
('jos', '1234567890')
('stacy', '1234567890')
('nancy', '1234567890')
('maria', '1234567890')

In [11]:
#using the select sttmt:(only year print in date)
q3="""
select year(date_ordered) from orders;
"""
connection = create_db_connection("localhost","root",password,db)
results=read_query(connection,q3)
for result in results:
    print(result)

mysql database connection successfully
(2018,)
(2019,)
(2019,)
(2018,)
(2019,)

In [12]:
#using the select sttmt:(only year print in date using distinct keyword)
q4="""
select distinct year(date_ordered) from orders;
"""
connection = create_db_connection("localhost","root",password,db)
results=read_query(connection,q4)
for result in results:
    print(result)

mysql database connection successfully
(2018,)
(2019,)

In [13]:
q5="""
select * from orders where date_ordered<'2018-12-31';
"""
connection = create_db_connection("localhost","root",password,db)
results=read_query(connection,q5)
for result in results:
    print(result)

mysql database connection successfully
(101, 'steve', 'laptop', datetime.date(2018, 6, 12), 2, 800.0, '1234567890')
(104, 'nancy', 't_shirts', datetime.date(2018, 7, 14), 7, 30.0, '1234567890')

In [14]:
q6="""
select * from orders where date_ordered>'2018-12-31';
"""
connection = create_db_connection("localhost","root",password,db)
results=read_query(connection,q6)
for result in results:
    print(result)

mysql database connection successfully
(102, 'jos', 'books', datetime.date(2019, 2, 10), 10, 12.0, '1234567890')
(103, 'stacy', 'trouseres', datetime.date(2019, 12, 25), 5, 50.0, '1234567890')
(105, 'maria', 'headphone', datetime.date(2019, 5, 30), 6, 48.0, '1234567890')

In [15]:
q7="""
select * from orders order by unit_price;
"""
connection = create_db_connection("localhost","root",password,db)
results=read_query(connection,q7)
for result in results:
    print(result)

mysql database connection successfully
(102, 'jos', 'books', datetime.date(2019, 2, 10), 10, 12.0, '1234567890')
(104, 'nancy', 't_shirts', datetime.date(2018, 7, 14), 7, 30.0, '1234567890')
(105, 'maria', 'headphone', datetime.date(2019, 5, 30), 6, 48.0, '1234567890')
(103, 'stacy', 'trouseres', datetime.date(2019, 12, 25), 5, 50.0, '1234567890')
(101, 'steve', 'laptop', datetime.date(2018, 6, 12), 2, 800.0, '1234567890')

In [16]:
#create dataframe 
from_db=[]

for result in results:
    result=list(result)
    from_db.append(result)
columns=["order_id",'customer_name','product_name',"date_ordered","quantity",
        "unit_price","phone_number"]    
df=pd.DataFrame(from_db,columns=columns) 
#pd.dataframe whiche is function converting to list to dataframe

display(df)

,order_id,customer_name,product_name,date_ordered,quantity,unit_price,phone_number
0,102,jos,books,2019-02-10,10,12.0,1234567890
1,104,nancy,t_shirts,2018-07-14,7,30.0,1234567890
2,105,maria,headphone,2019-05-30,6,48.0,1234567890
3,103,stacy,trouseres,2019-12-25,5,50.0,1234567890
4,101,steve,laptop,2018-06-12,2,800.0,1234567890

In [17]:
#update command (change the unit price one of the order command)

update="""
update orders
set unit_price=45
where order_id=103
"""

connection = create_db_connection("localhost","root",password,db)
execute_query(connection,update)

mysql database connection successfully
 Query was successfully

In [18]:
#using the select sttmt:(all data show)
q8="""
select * from orders where order_id=103;
"""
connection = create_db_connection("localhost","root",password,db)
results=read_query(connection,q8)
for result in results:
    print(result)

mysql database connection successfully
(103, 'stacy', 'trouseres', datetime.date(2019, 12, 25), 5, 45.0, '1234567890')

In [19]:
#delete commnad

delete_order="""
delete from orders
where order_id=105;
"""

connection = create_db_connection("localhost","root",password,db)
execute_query(connection,delete_order)

mysql database connection successfully
 Query was successfully

In [20]:
#using the select sttmt:(all data show)
q9="""
select * from orders;
"""
connection = create_db_connection("localhost","root",password,db)
results=read_query(connection,q9)
for result in results:
    print(result)

mysql database connection successfully
(101, 'steve', 'laptop', datetime.date(2018, 6, 12), 2, 800.0, '1234567890')
(102, 'jos', 'books', datetime.date(2019, 2, 10), 10, 12.0, '1234567890')
(103, 'stacy', 'trouseres', datetime.date(2019, 12, 25), 5, 45.0, '1234567890')
(104, 'nancy', 't_shirts', datetime.date(2018, 7, 14), 7, 30.0, '1234567890')